Repository: globus2008/Doubles-Rotation-Tournament
Catalog: languages/doubles-rotation-tournament-*.po
Languages: cs_cz

source: Doubles Rotation Tournament is an alternative form of a doubles tennis tournament, where players play each match with a different partner and in different positions (alternating left and right sides).
cs_cz: Turnaj rotujících čtyřher je společenská forma turnaje čtyřher, při které hráči sehrají zápasy v různých dvojicích a na různých pozicích. Výsledky turnaje určují vítěze v kategorii Nejlepší hráč a vítěze v kategorii Nejideálnější dvojice.

source: Doubles Rotation Tournament
cs_cz: Turnaj rotujících čtyřher

source: Overview of the available shortcode functions of the Doubles Rotation Tournament plugin.
cs_cz: Přehled dostupných shortcode funkcí pluginu Doubles rotation tournament.

source: Contribute to the sustainable development of this plugin by using
cs_cz: Přispějte na trvale udržitelný vývoj tohoto pluginu pomocí

source: gate.
cs_cz: brány.

source: This plugin is designed to support a variant of a doubles tennis tournament, where there is a frequent change of teammates and the game thus becomes more interesting.
cs_cz: Tento plugin je určený pro podporu varianty tenisového turnaje čtyřher, kdy dochází k častému střídání spoluhráčů a hra se tak stává zajímavější.

source: Item
cs_cz: Položka

source: Shortcode for embedding on the page
cs_cz: Shortcode pro vložení na stránku

source: Description of function
cs_cz: Popis funkce

source: Shows drawn games. Their number depends on the parameters of the tournament, such as the number of courts, the minimum number of non-playing players and, according to the permission to compare the number of matches. The tournament_id parameter is optional.
cs_cz: Zobrazí rozlosované hry. Jejich počet je závislý na parametrech turnaje, jako je počet kurtů, množství minimálně nehrajících hráčů a podle povolení srovnávat počet zápasů. Parametr tournament_id je volitelný.

source: Displays the list of tournament participants and their running ranking. The format of displayed names depends on the setting of the display full names parameter. Add the tournament number after the id parameter if necessary.
cs_cz: Zobrazí seznam účastníků turnaje a jejich průběžné hodnocení. Formát zobrazovaných jmen závisí na nastavení parametru zobrazování celých jmen. Za parametr id v případě potřeby doplňte číslo turnaje.

source: It will refresh the page after a certain number of seconds.
cs_cz: Zajistí obnovení stránky po uběhnutí určitého počtu vteřin.

source: It will display red marked reports from submitted forms.
cs_cz: Zobrazí červeně vyznačené hlášení z odeslaných formulářů.

source: Displays a list of drawn games for the selected tournament. The only_played parameter determines whether only played games are listed.
cs_cz: Zobrazí seznam rozlosovaných her pro vybraný turnaj. Parametr only_played určí, zda se vypíší jen odehrané hry.

source: Displays a list of drawn games only for the selected player.
cs_cz: Zobrazí seznam rozlosovaných her jen pro vybraného hráče.

source: Match results can be edited here. Especially useful when an error occurred when entering the result of a played match.
cs_cz: Zde se dají upravit výsledky zápasů. Vhodné zejména, když došlo k chybě při zadání výsledku odehraného zápasu.

source: Displays all game statistics for the selected player.
cs_cz: Zobrazí statistiku všech her pro vybraného hráče.

source: Allows the organizer to insert players from the user database. The only_web_admin parameter will limit the range of users of this function to only web administrators with the function admin, editor and editor-in-chief.
cs_cz: Umožní pořadateli vložit z databáze uživatelů hráče. Parametr only_web_admin omezí okruh uživatelů této funkce pouze na administrátory webu s funkcí admin, editor a šéfredaktor.

source: Allows the tournament organizer to remove players from the tournament. When whole_names=1, the whole names are displayed, if whole_names=0, the first 4 characters of the first name and the last 4 characters of the last name are displayed. The only_web_admin parameter will limit the range of users of this function to only web administrators with the function admin, editor and editor-in-chief.
cs_cz: Umožní pořadateli turnaje odebrat hráče z turnaje. Když whole_names=1, tak se zobrazí celá jména, pokud whole_names=0, tak se zobrazí první 4 znaky jména a poslední 4 znaky příjmení. Parametr only_web_admin omezí okruh uživatelů této funkce pouze na administrátory webu s funkcí admin, editor a šéfredaktor.

source: If the player is included in a special group, then his name will be colored blue in the table. These other players are provided with information about a different implementation of the game.
cs_cz: Pokud je hráč zařazen do speciální skupiny, pak se jeho jméno v tabulce vybarví modře. Tímto ostatním hráčům se poskytuje informace o jiném provedení hry.

source: Ability to cancel assignment to a special group for a player.
cs_cz: Možnost zrušit přiřazení do speciální skupiny u hráče.

source: It will allow the tournament organizer or the participant himself to temporarily suspend his participation in further matches. Then this player is not included in the draw for further games.
cs_cz: Umožní pořadateli turnaje nebo samotnému účastníkovi dočasně pozastavit svoji účast na dalších zápasech. Potom není tento hráč zařazen do losování dalších her.

source: It will allow the tournament organizer or participant to resume their participation in the tournament.
cs_cz: Umožní pořadateli turnaje nebo účastníkovi znovu obnovit svoji účast v turnaji.

source: Here you can manually enter information about the payment made by a certain player.
cs_cz: Zde můžete ručně zadat informace o platbě určitého hráče.

source: Here you can manually delete the information about the completed payment of a certain player.
cs_cz: Zde můžete ručně smazat informaci o provedené platbě určitého hráče.

source: A function that displays the optional parameters for the tournament and allows them to be changed. The whole_names parameter determines how player names will be displayed, and the only_web_admin parameter limits the range of users who are allowed to edit the tournament.
cs_cz: Funkce, která zobrazí volitelné parametry k turnaji a umožní jejich změnu. Parametr whole_names určí, jak se budou zobrazovat jména hráčů a parametr only_web_admin omezuje okruh uživatelů, kteří mají povolenou úpravu turnaje.

source: Displays the text for logging into the tournament by id. It works with the invitation text parameter. This link disappears when registration is closed.
cs_cz: Zobrazí text pro přihlášení do turnaje dle id. Pracuje s parametrem invitation text. Tento link zmizí, když je registrace uzavřena.

source: It will allow adding match organizer rights to other tournament participants.
cs_cz: Umožní přidat práva pořadatele zápasu na další účastníky turnaje.

source: Displays a list of available tournaments. If the display_rows parameter is not specified, only the last 20 tournaments will be displayed.
cs_cz: Zobrazí seznam dostupných turnajů. Pokud není parametr display_rows uveden, zobrazí se pouze posledních 20 turnajů.

source: Filtering displayed tournaments in the table.
cs_cz: Filtrování zobrazených turnajů v tabulce.

source: Shows a button to create a new tournament.
cs_cz: Zobrazí tlačítko pro vytvoření nového turnaje.

source: Shows help for using the main page.
cs_cz: Zobrazí nápovědu k použití hlavní stránky.

source: Displays a link to start the presentation of the selected tournament. In the admin menu, you can set which tournament parameters will be shown on the screen in the selected time sequence. Especially suitable for displaying the running results of the tournament on a larger screen.
cs_cz: Zobrazí odkaz pro spuštění prezentace vybraného turnaje. V admin menu můžete nastavit, které parametry turnaje se budou zobrazovat na obrazovce ve zvoleném časovém sledu. Vhodné zejména pro zobrazení průběžných výsledků turnaje na větší obrazovce.

source: Settings
cs_cz: Nastavení

source: Help
cs_cz: Nápověda

source: Environment settings
cs_cz: Nastavení prostředí

source: Presentation settings
cs_cz: Nastavení prezentace

source: Uninstall and activate
cs_cz: Odinstalujte a aktivujte

source: Here you can set restrictions for tournament administration from the website administrator's point of view.
cs_cz: Zde můžete nastavit omezení pro administraci turnaje z pohledu správce webu.

source: Can only the site administrator work with the player database?
cs_cz: Může s databází hráčů pracovat pouze administrátor webu?

source: Yes
cs_cz: Ano

source: No
cs_cz: Ne

source: By default, this is enabled by the site administrator. Otherwise, anyone can be allowed to view usernames and add them to their tournament.
cs_cz: Ve výchozím nastavení je to povoleno správcem webu. Jinak může kdokoli povolit zobrazení uživatelských jmen a jejich přidání do turnaje.

source: This setting has lower priority than using an attribute in the shortcode.
cs_cz: Toto nastavení má nižší prioritu než použití atributu v shortcode.

source: Maximum number of displayed tournaments in the table. (0 = no limit)
cs_cz: Maximální počet zobrazených turnajů v tabulce. (0 = bez limitu)

source: Enter a value between 0 and 100 for display rows.
cs_cz: Zadejte hodnotu mezi 0 a 100 pro počet zobrazených řádků.

source: Allow the tournament organizer to create a post to promote and administer the tournament?
cs_cz: Povolit organizátorovi turnaje vytvořit příspěvek k propagaci a správě turnaje?

source: By default, this is enabled by the site administrator. Otherwise, anyone can create a post.
cs_cz: Ve výchozím nastavení je to povoleno správcům webu. Jinak může příspěvek vytvořit kdokoli.

source: Choose the time after which the page will be refreshed. Good especially when you are not the only one entering new data.. (0 = no refresh)
cs_cz: Vyberte čas, po kterém se stránka obnoví. Dobré zvláště, když nejste jediní, kdo zadává nová data.. (0 = žádná aktualizace)

source: Enter a value between 0 and 1000 for the number of seconds.
cs_cz: Zadejte hodnotu mezi 0 a 1000 pro počet sekund.

source: Can only a website administrator create a new tournament?
cs_cz: Může nový turnaj vytvořit pouze správce webu?

source: By default, this is enabled by everybody who is logged in. Otherwise, only an administrator, editor or author can create a tournament.
cs_cz: Ve výchozím nastavení je toto povoleno pro každého, kdo je přihlášen. Jinak může turnaj vytvořit pouze administrátor, editor nebo autor.

source: Enter the maximum number of characters allowed in the players display name.
cs_cz: Zadejte maximální povolený počet znaků v zobrazovaném jménu přehrávače.

source: Enter a value between 5 and 30 for the number of characters.
cs_cz: Zadejte hodnotu mezi 5 a 30 pro počet znaků.

source: YouTube Video Link with a help.
cs_cz: Youtube video s nápovědou.

source: Enter the YouTube video link.
cs_cz: Vložte odkaz na Youtube video s nápovědou.

source: If you leave the field blank, the help video will not be displayed.
cs_cz: Pokud necháte pole prázdné, video s nápovědou se nezobrazí.

source: Display the output from this shortcode while the tournament presentation is on?
cs_cz: Zobrazit výstup z tohoto shortcode při zapnuté turnajové prezentaci?

source: Enter the number of seconds as the time between transitions to show the next shortcode.
cs_cz: Zadejte počet sekund jako dobu mezi přechody, aby se zobrazil další shortcode.

source: Enter a value between 1 and 120 for the number of seconds.
cs_cz: Zadejte hodnotu mezi 1 a 120 pro počet sekund.

source: Uninstall the tournament database at the same time as the plugin?
cs_cz: Odinstalovat databázi turnajů současně s pluginem?

source: If you ever want to return to the plugin, it will be a shame to lose your data.
cs_cz: Pokud se budete chtít k pluginu někdy vrátit, bude škoda o svá data přijít.

source: Uninstall tournament pages at the same time as the plugin?
cs_cz: Odinstalovat turnajové stránky současně s pluginem?

source: If you have edited page settings, here you have the option to keep these changes even in the event of an update or uninstallation.
cs_cz: Pokud jste upravili nastavení stránky, zde máte možnost tyto změny ponechat i v případě aktualizace nebo odinstalace.

source: Uninstall saved settings data at the same time as the plugin?
cs_cz: Odinstalovat uložená data nastavení současně s pluginem?

source: Update pages every time you activate the plugin?
cs_cz: Aktualizovat stránky při každé aktivaci pluginu?

source: This option keeps up with new plugin updates.
cs_cz: Tato možnost drží krok s novými aktualizacemi pluginu.

source: Settings saved successfully!
cs_cz: Nastavení byla úspěšně uložena!

source: Save Settings
cs_cz: Uložit nastavení

source: Rules of the Doubles Rotation Tournament
cs_cz: Pravidla Turnaje rotujících čtyřher

source: Played Matches ...
cs_cz: Odehrané zápasy ...

source: Player Management ...
cs_cz: Správa hráčů ...

source: Tournament Editing ...
cs_cz: Úprava turnaje ...

source: Tournament Selection ...
cs_cz: Výběr turnaje ...

source: Help ...
cs_cz: Nápověda ...

source: View the help video in an external window.
cs_cz: Zobrazit video s nápovědou v externím okně.

source: This standalone page will guide you through the entire tournament in all of the following consecutive stages:
cs_cz: Tato samostatná stránka vás provede celým turnajem ve všech těchto po sobě následujících etapách:

source: Create a new tournament
cs_cz: Vytvořit nový turnaj

source: The creator of the tournament becomes its organizer. Only the organizer has the right to close the registration and the tournament.
cs_cz: Kdo vytvoří turnaj, stává se jeho pořadatelem. Jen pořadatel má právo uzavřít registraci a turnaj.

source: Individual players sign up (or withdraw) in the list of available tournaments separately.
cs_cz: V rozpisu dostupných turnajů se přihlašují (případně odhlašují) samostatně jednotliví hráči.

source: Click on the tournament name to view its details.
cs_cz: Kliknutím na název turnaje se zobrazí jeho data.

source: Editing tournament parameters
cs_cz: Úprava parametrů turnaje

source: The total number of games in a match determines its duration. For example, if you choose 5, the match result can be 0:5, 1:4, 2:3, 3:2, 4:1, and 5:0.
cs_cz: Součet gemů v zápase udává délku zápasu. Jestliže zvolíte např. 5, pak výsledek zápasu může dopadnout 0:5, 1:4, 2:3, 3:2, 4:1 a 5:0.

source: You have the option to choose whether player names will be displayed in a shortened form to avoid disclosing sensitive information.
cs_cz: Máte možnost si zvolit, zda budou jména hráčů zobrazena zkráceně, aby nedocházelo ke zveřejnění citlivých údajů.

source: The Minimum Playing Players parameter determines the minimum number of players required to proceed to the next match. A higher number provides more variability but may also slow down the progress of the tournament.
cs_cz: Parametr minimálně nehrajících hráčů určuje minimální množství hráčů pro rozlosování dalšího zápasu. Větší číslo zajišťuje větší variabilitu, ale také může zpomalit průběh turnaje.

source: The website administrator can add an invitation to the tournament, which will be displayed through a newly created post.
cs_cz: Správce webu může přidat pozvánku na turnaj, která se zobrazí pomocí nově vytvořeného příspěvku.

source: The tournament organizer can grant organizer rights to another player.
cs_cz: Pořadatel turnaje může přidat pořadatelská práva jinému hráči.

source: Adding players and adding them to a special group
cs_cz: Přidání hráčů a přidání do speciální skupiny

source: Adding players from the database can be restricted to the website administrator.
cs_cz: Přidání hráčů z databáze může být omezeno pouze na správce webu.

source: Adding to a special group will colorfully alert the player to the pre-agreed method of handling the special group. This can only be done by the match organizer.
cs_cz: Přidání do speciální skupiny barevně upozorní hráče na předem dohodnutý způsob naložení se speciální skupinou. Toto může provést pouze pořadatel zápasu.

source: In the tournament settings, you can enable the possibility to track the payment of the entry fee.
cs_cz: V nastavení turnaje si můžete povolit možnost sledování zaplacení startovného.

source: Players can withdraw from the tournament on their own, or the match organizer can remove them from the match.
cs_cz: Odhlásit se mohou hráči samostatně nebo je může odebrat pořadatel zápasu.

source: The closing of player registration
cs_cz: Uzavření registrace hráčů

source: Only the tournament organizer can close the player registration.
cs_cz: Uzavřít registraci může opět pouze pořadatel turnaje.

source: Match scheduling and result entry
cs_cz: Rozlosování her a vkládání výsledků

source: Once the player registration is closed, the scheduling of the first matches will be displayed.
cs_cz: Jakmile se uzavře registrace hráčů, zobrazí se rozlosování prvních zápasů.

source: The serving starts with the player at position R1.
cs_cz: Podávat začíná hráč na pozici P1.

source: The number of matches scheduled depends on the chosen number of courts and the number of players.
cs_cz: Množství rozlosovaných zápasů závisí na zvoleném množství kurtů a počtu hráčů.

source: Only players participating in the match and the tournament organizer can enter match results.
cs_cz: Výsledky zápasu mohou vkládat pouze hráči nasazení v zápase a také pořadatel turnaje.

source: The option to hide a match is used only when, for example, one of the players is currently unavailable. This leads to the scheduling of another match, and this hidden match is not counted in the tournament results.
cs_cz: Volba skrýt zápas se používá jen tehdy, když by např. jeden z hráčů nebyl momentálně k dispozici. Tímto dochází k rozlosování dalšího zápasu a tento zápas se pak nepočítá do výsledků turnaje.

source: Each of the players can suspend their participation in the tournament. After that, the player will not be assigned to matches. Suspension of participation in the tournament can also be done by the administrator.
cs_cz: Každý z hráčů může pozastavit svoji účast v turnaji. Potom nebude systémem přiřazován do zápasů. Pozastavení účasti v turnaji může provést i administrátor.

source: In the list of played matches, the organizer can make corrections in case of incorrectly entered results.
cs_cz: V seznamu odehraných zápasů může pořadatel v případě chybně zadaného výsledku provést opravu.

source: In the table of registered players, the players with the best results are displayed at the top.
cs_cz: V tabulce přihlášených hráčů se na předním místě zobrazují hráči s nejlepšími výsledky.

source: Closing the tournament and announcing the winner.
cs_cz: Uzavření turnaje a vyhlášení vítěze.

source: Only the tournament organizer has the right to close the tournament. After closing, it is no longer possible to enter results or make edits.
cs_cz: Uzavřít turnaj má právo pouze pořadatel turnaje. Po uzávěrce již není možné vkládat výsledky a provádět editaci.

source: After the tournament is closed, the winner of the tournament with the best ratio of games won to losses will be highlighted in color in the table of registered players.
cs_cz: Po uzavření turnaje se zvýrazní barevně v tabulce přihlášených hráčů vítěz turnaje s nejlepším poměrem vyhraných ku prohraných gemů.

source: Presentation of the interim results of the tournament.
cs_cz: Prezentace průběžných výsledků turnaje.

source: You can start a presentation of the tournament on your computer screen, giving everyone the opportunity to easily get an overview of the progress of the tournament. Turn on full screen mode (F11) in the browser.
cs_cz: Prezentaci turnaje můžete spustit na obrazovce vašeho počítače a dát tak každému možnost snadno získat přehled o průběhu turnaje. Zapněte v prohlížeči režim celé obrazovky (F11).

source: Announcement of Doubles Rotation Tournament (Example)
cs_cz: Vyhlášení turnaje rotujících čtyřher (příklad)

source: This plugin will prepare an environment for tournament management in the form of rotating doubles.
cs_cz: Tento plugin připraví prostředí pro správu Turnajů rotujících čtyřher.

source: Doubles Rotation Tournament (hereinafter DoRoTo)
cs_cz: Turnaj rotujících čtyřher (dále DoRoTo)

source: is an alternative form of a doubles tennis tournament, where players play each match with a different partner and in different positions (alternating left and right sides).
cs_cz: je společenská forma turnaje čtyřher, při které hráči sehrají zápasy v různých dvojicích a na různých pozicích. Výsledky turnaje určují vítěze v kategorii Nejlepší hráč a vítěze v kategorii Nejideálnější dvojice.

source: This type of tournament stands out for its dynamism and social component, and thus can serve as a suitable environment for all doubles tournaments where different groups of players meet on the court. The ratio of games won to games lost is calculated for each participant. The winner of the tournament is the player with this highest ratio. Such a player can best adapt to new circumstances and thus becomes an ideal teammate for doubles.
cs_cz: Jedná se o alternativní formu tenisového turnaje čtyřher, kde do každého zápasu nastupují hráči s jiným partnerem a na různých pozicích (střídání levé a pravé strany). Tento typ turnaje vyniká svoji dynamikou a společenskou složkou a tak může sloužit jako vhodné prostředí ke všem turnajům čtyřher, kde se na kurtě střetávají různé skupiny hráčů.

source: Content:
cs_cz: Obsah:

source: Objective of Doubles Rotation Tournament
cs_cz: Cíl Turnaje rotujících čtyřher

source: Principle of the game
cs_cz: Princip hry

source: Preparing the game
cs_cz: Příprava hry

source: Start of the game
cs_cz: Začátek hry

source: Tournament Progress
cs_cz: Průběh turnaje

source: Evaluation of the tournament
cs_cz: Vyhodnocení turnaje

source: Comparison with the classic tournament
cs_cz: Porovnání s klasickým turnajem

source: opening up participation to players of various skill levels (especially suitable for tournaments where it might be challenging to gather players of similar skill levels)
cs_cz: otevřít účast pro hráče různých úrovní dovednosti (zejména vhodné pro turnaje, kde by nebylo snadné získat více hráčů přibližně na stejné úrovni)

source: creating a pleasant atmosphere for social events
cs_cz: vytvoření příjemné atmosféry pro společenské události

source: making new friends
cs_cz: poznat nové přátele

source: In DoRoTo
cs_cz: V DoRoTo

source: fully adheres to the official tennis rules except for the exceptions described below.
cs_cz: plně platí oficiální pravidla tenisu až na popsané vyjímky níže.

source: Explanation of abbreviation: DoRoTo (DOuble ROtation TOurnament)
cs_cz: Vysvětlivka zkratky: DoRoTo (DOuble ROtation TOurnament) = Turnaj rotujících čtyřher

source: Participants of the tournament randomly change partners several times during the tournament and play against different pairs. For each participant, the ratio of games won to games lost is calculated.
cs_cz: Účastníci turnaje si náhodným výběrem několikrát za turnaj vymění partnera a hrají proti rozdílným párům. Pro každého účastníka se počítá poměr vyhraných ku prohraným gemům.

source: The winner of the tournament is the player with the highest ratio. Such a player can adapt best to new circumstances and becomes the ideal teammate for doubles matches.
cs_cz: Vítězem turnaje v kategorii nejlepší hráč se stává účastník s tímto nejvyšším poměrem. Takový hráč se dokáže nejlépe přizpůsobit novým okolnostem a stává se tak ideálním spoluhráčem pro 4 hru.

source: Optionally, a final match can be organized, from which 2 players will be announced as winners in the category of the most ideal pair.
cs_cz: Volitelně lze uspořádat závěrečný zápas, ze kterého budou vyhlášeni 2 hráči jako vítězové v kategorii nejideálnější dvojice.
