Repository: globus2008/Doubles-Rotation-Tournament
Catalog: languages/doubles-rotation-tournament-*.po
Languages: cs_cz

source: If you want, you can adjust the Maximum number of games and Settings of the possible results of the match for this match.
cs_cz: Pokud chcete, můžete pro tento zápas upravit Maximální počet gemů a Nastavení možných výsledků zápasu.

source: Best Player Winner:
cs_cz: Vítěz v kategorii nejlepší hráč:

source: Currently, the following matches are being played in tournament no.
cs_cz: Nyní se hrají tyto zápasy z turnaje č.

source: Hide
cs_cz: Skrýt

source: Result
cs_cz: Výsledek

source: Save
cs_cz: Uložit

source: Edit tournament no.
cs_cz: Editace turnaje č.

source: Variable
cs_cz: Proměnná

source: Value
cs_cz: Hodnota

source: The name of the tournament can be edited here.
cs_cz: Zde lze upravit jméno turnaje.

source: This option determines whether player names will be displayed in full or if they will be obfuscated to protect personal data.
cs_cz: Tato volba určuje, jestli se budou jména hráčů zobrazovat celá nebo dojde k jejich zkomolení z důvodu ochrany osobních údajů.

source: Abbreviated names
cs_cz: Zkomolená jména

source: Full names
cs_cz: Celá jména

source: Number of courts available for the tournament.
cs_cz: Počet kurtů, které jsou k dispozici pro turnaj.

source: The minimum number of non-playing players required to schedule another match. A higher number ensures greater variability but may result in longer waiting times for the next match. A lower number speeds up the game but may lead to some players playing more matches than others. The default value is 0, which means that the next scheduling will occur only after all previously scheduled matches are completed.
cs_cz: Minimální počet nehrajících hráčů, aby byl rozlosován další zápas. Větší číslo zajistí větší variabilitu, ale déle se čeká na další rozlosování zápasu. Nízkým číslem se zrychlí průběh hry, ale někteří hráči odehrají více zápasů než jiní. Výchozí hodnota 0 = další rozlosování nastane, až se dohrají všechny rozlosované zápasy.

source: Maximum sum of games in a match.
cs_cz: Maximální součet gemů v zápase.

source: Maximum number of registered players. (0 = no limit)
cs_cz: Maximální počet přihlášených hráčů. (0 = bez limitu)

source: Setting possible match results:
cs_cz: Nastavení možných výsledků zápasu:

source: (example for Maximum number of games in a match = 5)
cs_cz: (příklad pro Maximální počet gemů v zápase = 5)

source: Basic settings according to the parameter Maximum number of games in a match.
cs_cz: Základní nastavení dle parametru Maximální počet gemů v zápase.

source: For example (5:0, 4:1, 3:2)
cs_cz: Například (5:0, 4:1, 3:2)

source: If it is no longer possible to win a match, this option allows for the possibility of an early termination. For example, in a game played up to 5 sets, the match can be concluded even if the current score is 3:0.
cs_cz: Pokud již nelze zápas vyhrát, tak zde lze povolit možnost předčasného ukončení. Například při hře do 5 gemů lze ukončit již při průběžném výsledku 3:0.

source: For example (5:0, 4:1, 3:2, 3:1, 3:0)
cs_cz: Například (5:0, 4:1, 3:2, 3:1, 3:0)

source: The game can only be ended with a lead of 2 gems. For example, a 5-game match ends at 4:1, but continues if the current score is 3:2. However, it ends at 4:2 or 4:3 (ended in a tiebreak).
cs_cz: Hru lze ukončit pouze při náskoku 2 gemů. Zápas při hře do 5 gemů např. končí při výsledku 4:1, ale pokračuje dále, pokud je aktuální skóre 3:2. Končí však při 4:2 nebo 4:3 (zakončeno v tiebreak).

source: For example (5:3, 4:2, 4:1, 5:0)
cs_cz: Například (5:3, 4:2, 4:1, 5:0)

source: The game can only be ended when the lead is not only 2 games, but also prematurely, when the match can no longer be won.
cs_cz: Hru lze ukončit pouze při náskoku nejen 2 gemů, ale i předčasně, když zápas již nelze vyhrát.

source: For example (5:3, 4:2, 4:1, 4:0, 5:0)
cs_cz: Například (5:3, 4:2, 4:1, 4:0, 5:0)

source: Basic settings
cs_cz: Základní nastavení

source: Allow early match termination
cs_cz: Povolit předčasné ukončení zápasu

source: End the game only with a lead of 2 games
cs_cz: Ukončit hru jen při náskoku 2 gemů

source: End the game early and even with a 2 game lead
cs_cz: Ukončit hru předčasně a i při náskoku 2 gemů

source: Can a player who is currently suspended be declared the winner?
cs_cz: Může hráč, který má momentálně pozastavenou účast, být vyhlášen vítězem?

source: Can a player in a special group win a tournament?
cs_cz: Může hráč ve speciální skupině vyhrát turnaj?

source: Skip matches where 2 players would play together in a special group?
cs_cz: Přeskočit zápasy, kde by hráli společně 2 hráči ve speciální skupině?

source: Skip matches where 2 non-special group players would play together?
cs_cz: Přeskočit zápasy, kde by hráli společně 2 hráči mimo speciální skupinu?

source: Can players independently enter game results?
cs_cz: Mohou hráči samostatně zadávat výsledky hry?

source: After the tournament closes, allow a final match to determine the best pair?
cs_cz: Po uzavření turnaje umožnit finálový zápas, který by určil nejlepší dvojici?

source: Show control over the paid entry fee?
cs_cz: Umožnit kontrolu nad zaplaceným startovným?

source: When you check the box, a new post dedicated only to this tournament will be created.
cs_cz: Při zaškrtnutí políčka se vytvoří nový příspěvek věnovaný jen tomuto turnaji.

source: (Available only for website administrators)
cs_cz: (Dostupné pouze pro správce webu)

source: Welcome text for the tournament. It will be inserted into a new post. HTML tags can be used.
cs_cz: Uvítací text do turnaje. Bude vložen do nového příspěvku. Lze použít HTML tagy.

source: Checking the box will delete all match results and put the tournament into open registration. Thanks to this option, you can test the course of the tournament with the option of returning to the default state. (Irreversible change!)
cs_cz: Při zaškrtnutí políčka se smažou výsledky všech zápasů a turnaj se uvede do stavu otevřené registrace. Díky této možnosti lze provést testování průběhu turnaje s možností návratu do výchozího stavu. (Nevratná změna!)

source: Checking the box will delete the tournament record after saving. (Irreversible change!)
cs_cz: Při zaškrtnutí políčka se po uložení smaže záznam o turnaji. (Nevratná změna!)

source: You are not authorized to change the parameters of tournament no.
cs_cz: Nemáte oprávnění měnit parametry turnaje č.

source: Tournament parameters cannot be changed more than 24 hours after closing.
cs_cz: Parametry turnaje více jak 24 hodin po uzavření nelze měnit.

source: You must log in to change tournament parameters!
cs_cz: Pro změnu parametrů turnaje se musíte přihlásit!

source: You do not have the necessary rights to create a post.
cs_cz: Nemáte potřebná práva k vytvoření příspěvku.

source: Tournament parameters no.
cs_cz: Parametry turnaje č.

source: were saved.
cs_cz: byly uloženy.

source: Details about tournament no.
cs_cz: Detaily k turnaji č.

source: You can enter the tournament using this link:
cs_cz: Do turnaje se můžete přihlásit pomocí tohoto odkazu:

source: Log in/Log out from the tournament
cs_cz: Přihlásit/Odhlásit z turnaje

source: If you wish, you can as an administrator
cs_cz: Pokud si přejete, tak můžete jako administrátor

source: close registration
cs_cz: uzavřít registraci

source: reopen registration
cs_cz: znovu otevřít registraci

source: back to drawn matches
cs_cz: zpět k losovaným zápasům

source: start the final match
cs_cz: začít finálový zápas

source: reopen the tournament
cs_cz: znovu otevřít turnaj

source: end the tournament
cs_cz: ukončit turnaj

source: List of available tournaments:
cs_cz: Rozpis dostupných turnajů:

source: Log in
cs_cz: Přihlásit

source: Players count
cs_cz: Počet hráčů

source: Creation date
cs_cz: Datum vytvoření

source: Registration status
cs_cz: Stav registrace

source: Organizer
cs_cz: Pořadatel

source: Tournament status
cs_cz: Stav turnaje

source: Log out
cs_cz: Odhlásit se

source: registration allowed
cs_cz: registrace povolena

source: registration closed
cs_cz: registrace ukončena

source: finished tournament
cs_cz: ukončený turnaj

source: open tournament
cs_cz: otevřený turnaj

source: No tournament has been found.
cs_cz: Nebyl nalezen žádný turnaj.

source: You must log in to confirm a payment!
cs_cz: Pro potvrzení platby se musíte přihlásit!

source: You do not have permission to confirm a payment.
cs_cz: Nemáte oprávnění potvrdit platbu.

source: All players have already paid.
cs_cz: Všichni hráči již zaplatili.

source: Confirm the payment of the selected player in tournament no.
cs_cz: Potvrdit platbu vybraného hráče v turnaji č.

source: Confirm payment
cs_cz: Potvrdit platbu

source: The payment of the player
cs_cz: Platba hráče

source: has been added to the list.
cs_cz: byl přidán do seznamu.

source: You must log in to remove a payment!
cs_cz: Pro odstranění platby se musíte přihlásit!

source: You do not have permission to remove a payment.
cs_cz: Nemáte oprávnění odebrat platbu.

source: None of the players have paid yet.
cs_cz: Žádný z hráčů zatím nezaplatil.

source: Remove the payment of the selected player in tournament no.
cs_cz: Odstranit platbu vybraného hráče v turnaji č.

source: Remove payment
cs_cz: Odstranit platbu

source: has been removed from the list.
cs_cz: byl odebrán ze seznamu.

source: Only Open Registration
cs_cz: Pouze otevřít registraci

source: Still Playing
cs_cz: Stále se hraje

source: Only Closed
cs_cz: Jen uzavřené

source: Where I Am Logged In
cs_cz: Kde jsem přihlášený

source: Where I Am Not Logged In
cs_cz: Kde nejsem přihlášený

source: Where I Am Admin
cs_cz: Kde jsem správcem

source: Where I Am Not Admin
cs_cz: Kde nejsem správcem

source: Filter Tournaments
cs_cz: Filtrovat turnaje

source: If you log in, you can start the presentation of the selected tournament.
cs_cz: Pokud se přihlásíte, můžete spustit prezentaci vybraného turnaje.

source: Click here to run the presentation.
cs_cz: Kliknutím sem spustíte prezentaci.

source: Click here to stop the presentation.
cs_cz: Kliknutím sem prezentaci zastavíte.

source: Match list not found!
cs_cz: Rozpis zápasů nebyl nalezen!

source: The small number of active players does not allow another match to be drawn.
cs_cz: Malý počet aktivních hráčů nedovoluje rozlosovat další zápas.

source: The tournament settings do not allow the next match to be drawn.
cs_cz: Nastavení turnaje nedovoluje rozlosovat další zápas.

source: I invite you to
cs_cz: Zvu Vás na

source: Doubles Rotation Tournament!
cs_cz: Turnaj rotujících čtyřher!

source: You must log in to add a tournament!
cs_cz: Pro přidání turnaje se musíte přihlásit!

source: You do not have site administrator privileges to create a new tournament.
cs_cz: K vytvoření nového turnaje nemáte oprávnění správce webu.

source: A new tournament has just been created.
cs_cz: Právě byl vytvořen nový turnaj.

source: was created.
cs_cz: byl vytvořen.

source: Confirm the final pairings for the match that will determine the winning team.
cs_cz: Potvrďte finálové dvojice pro zápas, který určí vítězný tým.

source: Save the composition of the final group
cs_cz: Uložit složení finálové skupiny

source: You do not have permission to make a final group.
cs_cz: Nemáte oprávnění pro složení finálové skupiny.

source: Final group composition saved.
cs_cz: Složení finálové skupiny uloženo.

source: You can start playing the final match.
cs_cz: Můžete začít hrát finálový zápas.

source: Please choose different names for L1, R1, L2 and R2!
cs_cz: Vyberte prosím různá jména pro L1, P1, L2 a P2!

source: The final match is over!
cs_cz: Finálový zápas byl ukončen!

source: was saved with a score
cs_cz: byl uložen se skóre

source: Match no.
cs_cz: Zápas č.

source: was skipped.
cs_cz: byl přeskočen.

source: was previously entered with a score
cs_cz: byl již dříve zadán se skóre

source: has not been scheduled yet.
cs_cz: zatím nebyl rozlosován.

source: A tournament cannot be closed while player registration is open.
cs_cz: Turnaj nelze uzavřít, když je registrace hráčů otevřená.

source: does not have sufficient occupancy to close registration.
cs_cz: nemá dostatečnou obsazenost pro uzavření registrace.

source: Registration of tournament players no.
cs_cz: Registrace hráčů turnaje č.

source: was closed.
cs_cz: byla uzavřena.

source: was open for registration.
cs_cz: byl otevřen pro registraci.

source: My first Doubles Rotation Tournament
cs_cz: Můj první turnaj rotujících čtyřher

source: I invite you to participate in testing the principle of operation of the Doubles Rotation Tournament. This is only a virtual tournament without actual play on the tennis court.
cs_cz: Zvu Vás k účasti na testování principu fungování turnaje rotujících čtyřher. Jedná se pouze o virtuální turnaj bez skutečné hry na tenisovém kurtu.

source: The data is being displayed for the tournament no.
cs_cz: Zobrazují se data k turnaji č.

source: List of available tournaments was updated.
cs_cz: Seznam dostupných turnajů byl aktualizován.
