Repository: globus2008/Doubles-Rotation-Tournament
Catalog: languages/doubles-rotation-tournament-*.po
Languages: cs_cz

source: Game Preparation
cs_cz: Příprava hry

source: Agreement on the Game Format
cs_cz: Dohoda na formátu hry

source: Before the tournament begins, the game format is agreed upon. The following parameters play a decisive role:
cs_cz: Ještě před začátkem turnaje se dohodne formát hry. Do rozhodovací role zasahují tyto parametry:

source: the number of courts allocated for play
cs_cz: počet kurtů vyčleněných ke hře

source: estimated duration of the tournament
cs_cz: předpokládaná doba trvání turnaje

source: the total agreed sum of games in each match
cs_cz: celkový dohodnutý součet gemů v každé hře

source: number of players
cs_cz: počet hráčů

source: amount of players in
cs_cz: množství hráčů ve

source: special group
cs_cz: speciální skupině

source: The outcome of this agreement should be the determination of how many matches each player can play in different pairs and how many total gems each match will have.
cs_cz: Výsledkem této dohody by mělo být stanovení, kolik her v rozličných dvojcích může každý hráč odehrát a kolik dohromady gemů bude mít každá hra.

source: Example
cs_cz: Příklad

source: The tournament organizer has 2 courts available. They plan to organize a doubles tournament for 20 players within a time frame from 9:00 AM to 3:00 PM. It is estimated that 15 games can be played on 1 court within 1 hour. Altogether, it is possible to play approximately 6 hours x 15 games x 2 courts = 180 games.
cs_cz: Pořadatel turnaje má k dispozici 2 kurty. Na nich plánuje uspořádat turnaj čtyřher pro 20 hráčů v časovém rámci od 9:00 do 15:00 hod. Odhadem lze odehrát 15 gemů na 1 kurtu během 1 hodiny. Dohromady lze přibližně odehrát 6 hodin x 15 gemů x 2 kurty = 180 gemů.

source: Now, assuming a game with a total of 5 games, which allows for 36 matches to be played (180 / 5). Each player will participate in an average of 36 / (20 / 4) = 7 games.
cs_cz: Nyní předpokládejmu hru na celkový součet 5 gemů, která umožní odehrát 36 zápasů (180 / 5). Každý hráč se zúčastní v průměru 36 / (20 / 4) = 7 her.

source: If the organizer wanted to ensure quicker rotation of pairs, they could opt for a total of 3 games per match. Then, it would be possible to play 180 / 3 = 60 matches, and each player would participate in an average of 60 / (20 / 4) = 12 games.
cs_cz: Pokud by pořadatel chtěl zajistit rychlejší střídání dvojic, lze přistoupit na celkový počet 3 gemů v zápase. Potom by se stihlo odehrát 180 / 3 = 60 zápasů a každý hráč by se v průměru zúčastnil 60 / (20 / 4) = 12 her.

source: With the aim of allowing players to play with more tennis partners during the tournament, we will try to choose more matches with a smaller number of played games.
cs_cz: S ohledem na to, že cíl turnaje spočívá ve snaze hráčům umožnit během turnaje si zahrát s více tenisovými partnery, tak se budeme snažit zvolit více zápasů s menším množstvím odehraných gemů.

source: The table determining who will play with whom and on which side of the court will be provided by dedicated software through random selection. With an increasing number of players, the number of match combinations grows significantly, making it difficult to manage the tournament successfully without computational techniques.
cs_cz: Tabulku určující, kdo s kým bude hrát a na jaké straně kurtu, zajistí k tomu určený software pomocí náhodného výběru. Se vzrůstajícím počtem hráčů se násobně zvětšuje počet kombinací zápasu a bez výpočetní techniky si lze těžko představit úspěšný management turnaje.

source: Special group
cs_cz: Speciální skupina

source: Players of various skill levels will participate in the tournament. In order not to create a pair that is too weak or too strong due to random selection, less skilled or too strong players are placed in a special group. This special group, in addition to respectful treatment from players, ensures that pairs consisting of 2 players from this group or 2 players outside of this group are optionally not drawn. It is also possible to ensure that a player in this special group is not declared the winner.
cs_cz: Turnaje se budou účastit hráči různých dovedností. Aby náhodným výběrem nebyla sestavena příliš slabá nebo silná dvojice, zařadí se méně dovední nebo příliš silní hráči do speciální skupiny. Tato speciální skupina kromě ohleduplného zacházení od hráčů zajistí, aby volitelně nebyly rozlosovány dvojice tvořené 2 hráči v této skupině nebo 2 hráči mimo tuto skupinu. Lze též zajistit, aby hráč v této speciální skupině nebyl vyhlášen vítězem.

source: Parents of playing children can be placed in a special group. When it is set that neither 2 players in the group nor 2 players outside the group will be drawn into a pair, a parent-child pair is always ensured. When choosing that a player in a special group cannot win, it is ensured that the winner is not the parent, but only the highest placed child.
cs_cz: Do speciální skupiny se mohou umístit rodiče hrajících dětí. Když se nastaví, že nebudou vylosováni do dvojice 2 hráči ve skupině ani 2 hráči mimo skupinu, zajistí se vždy dvojice rodič-dítě. Při volbě, že hráč ve speciální skupině nemůže vyhrát, se zajistí, že nebude jako vítěz vyhlášen rodič, ale jen nejvýše posazené dítě.

source: Using a special group is optional. If men of approximately the same level will play, the use of a special group loses its meaning.
cs_cz: Použití speciální skupiny je volitelné. Pokud budou hrát muži přibližně stejné úrovně, ztrácí použití speciální skupiny význam.

source: The course of the game is determined by randomly drawn matches. The following can be read from the description of the drawn matches:
cs_cz: Průběh hry určují náhodně vylosované zápasy. Z popisu vylosovaných zápasů lze vyčíst:

source: who will play against whom (L1 & R1)
cs_cz: kdo s kým bude hrát (L1 + P1)

source: against which pair they will play (against L2 & R2)
cs_cz: proti jaké dvojici bude hrát (proti L2 + P2)

source: on which side the player will be standing while receiving (L - left or R - right side)
cs_cz: na jaké straně bude hráč při příjmu stát (L -levá nebo P -pravá strana)

source: who starts with the serve in the first game (player with the index R1)
cs_cz: kdo v prvním gemu začíná s podáním (hráč s indexem P1)

source: During the tournament, results are continuously recorded, allowing players to observe their overall ranking during the course of the event.
cs_cz: Během turnaje se průběžně zapisují výsledky a tak lze během turnaje pozorovat, jak si hráči stojí v celkovém pořadí.

source: At the beginning of the tournament, it can be agreed that matches that cannot be won anymore may be prematurely ended based on a request from the losing pair.
cs_cz: Na začátku turnaje se lze dohodnout, že zápasy, které již nelze dohrát vítězně, se mohou na základě žádosti prohrávající dvojice předčasně ukončit.

source: It can also be agreed that only a result with a difference of 2 games will be accepted. A combination of a 2-game difference and an early exit option can also be set.
cs_cz: Také se lze dohodnout, že bude akceptován jen výsledek s rozdílem 2 gemů. Může být také nastavena kombinace rozdílu 2 gemů a možnosti předčasného ukončení.

source: For example, if the total sum of games played is 5, the match can be concluded with scores like 0:3 or 1:3. If the total sum of gems played is 7, the match can be ended at scores like 0:4, 1:4, 2:4, or 1:5.
cs_cz: Například pokud se hraje do celkového součtu 5 gemů, lze zápas ukončit již za stavu 0:3 i 1:3. Jestliže se hraje do celkového součtu 7 gemů, lze zápas ukončit při výsledku 0:4, 1:4, 2:4, případně 1:5.

source: If a result with a difference of 2 games is required when playing up to a total of 5 games, then the match cannot be ended at 3:2, but it is at 4:2. If the game is tied, the match concludes with a tiebreak, with a score of 4:3.
cs_cz: Pokud bude vyžadován výsledek s rozdílem 2 gemů při hře do celkového součtu 5 gemů, tak nelze zápas ukončit za stavu 3:2, ale za stavu 4:2 ano. Pokud bude hra vyrovnaná, zápas končí tiebreakem s výsledkem 4:3.

source: The winner of the tournament is announced as the player with the highest ratio of games won to games lost. This player may be proclaimed as
cs_cz: Jako vítěz turnaje se vyhlašuje hráč s nejvyšším skóre vyhraných ku prohraným gemům. Tento hráč může být vyhlášen za

source: Best Doubles Partner
cs_cz: Nejlepšího partnera pro čtyřhru

source: If multiple players have the same score, multiple players may be declared winners of the tournament.
cs_cz: Pokud má více hráčů shodné skóre, může být vyhlášeno více hráčů jako vítěz turnaje.

source: If, optionally, a final match between the 4 selected participants with the highest score is arranged at the end, then 2 players will emerge from this final as the winners in the category of the Most Ideal Pair.
cs_cz: Pokud se volitelně na závěr uspořádá finálový zápas mezi 4 vybranými účastníky s nejvyšším skóre, tak z tohoto finále vzejdou 2 hráči jako vítězové v kategorii Nejideálnější dvojice.

source: There is a rotation of teammates (DoRoTo tries, depending on the setup and the number of games, to play with everyone as much as possible, alternating the left and right sides of the court equally).
cs_cz: Dochází ke střídání spoluhráčů (DoRoTo se snaží podle nastavení a počtu her, abyste hráli pokud možno s každým a při tom střídali rovnoměrně levou a pravou stranu kurtu).

source: An individual can enter the tournament without a teammate (thanks to rotation, you do not have a permanent partner anyway).
cs_cz: Do turnaje se může přihlásit jednotlivec bez spoluhráče (díky střídání stejně nemáte stálého partnera).

source: The tournament can be organized even with an odd number of players and even with a minimum lineup of 4 players (this DoRoTo feature saves the tournament organizer a lot of trouble).
cs_cz: Turnaj lze uspořádat i v lichém počtu hráčů a dokonce i v minimální sestavě 4 hráčů (tato DoRoTo vlastnost ušetří organizátorovi turnaje mnohé starosti).

source: DoRoTo allows you to define a special group of players for which special conditions can be set (if women are included in the special group, it can be set that only male+female pairs are drawn. Alternatively, male+male can be allowed but female+female prohibited. And vice versa (Similar combinations can be created in the relationship of parent + child or strong + weaker player).
cs_cz: DoRoTo umožňuje definovat speciální skupinu hráčů, pro kterou lze nastavit speciální podmínky (pokud se do speciální skupiny zařadí ženy, tak lze nastavit, aby byly vylosovány pouze dvojice můž+žena. Případně lze povolit muž+muž, ale zakázat žena+žena. A opačně. Podobné kombinace lze vytvořit ve vztahu rodič+dítě nebo výkonnostně silný + slabší hráč).

source: DoRoTo does not take place in the form of eliminations, so players are still in the game for the duration of the tournament and will play the same number of matches according to the settings.
cs_cz: DoRoTo turnaj neprobíhá formou vyřazování a tak hráči po dobu turnaje jsou stále ve hře a odehrají podle nastavení stejný počet zápasů.

source: Usually shorter matches are played and thus more will be played during the tournament (or, on the contrary, shorter matches allow more players to participate).
cs_cz: Většinou se hrají kratší zápasy a tak se jich za turnaj odehraje více (nebo naopak kratší zápasy umožní účast více hráčů).

source: The tournament can be interrupted or extended in time at any time and it will not disrupt its progress in any way.
cs_cz: Turnaj lze kdykoliv přerušit nebo v čase natáhnout a nijak to nenaruší jeho průběh.

source: Players can temporarily or permanently interrupt their game or enter the tournament in the middle, for example.
cs_cz: Hráči mohou v průběhu turnaje svoji hru dočasně nebo trvale přerušit nebo do turnaje vstoupit.

source: It is not necessary for each player to play the same number of matches (the final ranking is determined only by the ratio of games won to games lost).
cs_cz: Není nutné, aby každý hráč odehrál stejný počet zápasů (pro výsledné pořadí totiž rozhoduje jen poměr vyhraných ku prohraným gemům).

source: DoRoTo perfectly provides an overview of the quality of individual players, where the quality of a teammate does not affect the rating due to the frequent change of partners.
cs_cz: DoRoTo dokonale podá přehled o kvalitě jednotlivých hráčů, kde na hodnocení nemá díky častému střídání partnerů vliv kvalita spoluhráče.

source: There is no downtime during the tournament waiting for a match to be played to move the tournament forward.
cs_cz: Během turnaje nedochází k prostojům, kdy by se čekalo, až se odehraje nějaký zápas, aby se turnaj posunul dále.

source: At the end of DoRoTo, 2 categories of winners will be announced: the Best player of the tournament and the Most ideal pair of the tournament (theoretically, this pair could play together for the first time during the final match).
cs_cz: Na závěr DoRoTo se vyhlásí 2 kategorie vítězů: nejlepší hráč turnaje a nejideálnější dvojice turnaje (teoreticky tato dojice mohla poprvé hrát spolu až při finálovém zápasu).

source: Rules for the Doubles Rotation Tournament can be found on a separate page
cs_cz: Pravidla Turnaje rotujících čtyřher lze najít na samostatné stránce

source: The link to the Rules page for the Doubles Rotation Tournament is currently unavailable.
cs_cz: Odkaz na stránku s pravidly Turnaje rotujících čtyřher momentálně není k dispozici.

source: The schedule of Doubles Rotation Tournaments can be found on a separate page
cs_cz: Rozpis Turnajů rotujících čtyřher lze najít na samostatné stránce

source: The link to the doubles rotation tournament schedule page is currently unavailable.
cs_cz: Odkaz na stránku s rozpisem turnajů rotujících čtyřher momentálně není k dispozici.

source: The tournament was not found.
cs_cz: Turnaj nebyl nalezen.

source: No one has registered for the tournament yet.
cs_cz: Do turnaje se zatím nikdo nepřihlásil.

source: Not a single match was played, so everyone is a winner.
cs_cz: Nebyl odehrán ani jeden zápas a tak vítězem jsou všichni.

source: Tournament ID was not provided.
cs_cz: ID turnaje nebylo zadáno.

source: If you want to register for the tournament, you must log in to your account!
cs_cz: Pokud se chcete zaregistrovat do turnaje, tak se musíte přihlásit ke svému účtu!

source: A player cannot be removed because at least one match has already been played in the tournament.
cs_cz: Nelze odebrat hráče, protože již byl odehrán v turnaji alespoň jeden zápas.

source: You have opted out of tournament no.
cs_cz: Odhlásil jste se z turnaje č.

source: You signed up for tournament no.
cs_cz: Přihlásil jste se do turnaje č.

source: We are sorry, but the maximum number of registered participants has been reached in tournament no.
cs_cz: Litujeme, ale bylo dosaženo maximálního počtu přihlášených účastníků v turnaji č.

source: The registration for the tournament has already been closed.
cs_cz: Turnaj je již uzavřen pro registraci.

source: Unknown player
cs_cz: Neznámý hráč

source: Missing tournament ID
cs_cz: Chybí turnaj ID

source: No tournament has been created yet.
cs_cz: Zatím nebyl vytvořen ani jeden turnaj.

source: Once registration is closed, statistical data will be available.
cs_cz: Jakmile bude uzavřena registrace, budou statistická data k dispozici.

source: Statistical data cannot be displayed without using a filter.
cs_cz: Statistická data nelze zobrazit bez použití filtru.

source: Tournament no.
cs_cz: Turnaj č.

source: Statistical data for
cs_cz: Statistická data pro

source: Player
cs_cz: Hráč

source: Teammate L
cs_cz: Spoluhráč L

source: Teammate R
cs_cz: Spoluhráč P

source: Opponent
cs_cz: Protihráč

source: Total
cs_cz: Celkem

source: Invalid value entered.
cs_cz: Vložena nesprávná hodnota.

source: You do not have permission to modify tournament results.
cs_cz: Nemáte oprávnění měnit výsledky turnaje.

source: The option to modify the match results is closed.
cs_cz: Možnost měnit výsledky zápasu je uzavřena.

source: Change of match result in tournament No.
cs_cz: Změna výsledku zápasu v turnaji č.

source: The final match
cs_cz: Finálový zápas

source: Edit result
cs_cz: Upravit výsledek

source: No matches have been played in the tournament yet, so there is nothing to edit.
cs_cz: V turnaji zatím nebyl odehrán žádný zápas, takže není co upravit.

source: Invalid request.
cs_cz: Neplatná žádost.

source: Missing tournament ID, match number, or game result.
cs_cz: Chybí ID turnaje, číslo zápasu nebo výsledek zápasu.

source: You must be logged in to change the result!
cs_cz: Pro změnu výsledku se musíte přihlásit!

source: The result of match no.
cs_cz: Výsledek zápasu č.

source: was changed.
cs_cz: byl změněn.

source: The result of the final match
cs_cz: Výsledek finálového zápasu

source: Players
cs_cz: Hráči

source: total
cs_cz: celkem

source: from maximum
cs_cz: z maximálně

source: tournament no.
cs_cz: turnaje č.

source: Registration
cs_cz: Registrace

source: to the tournament is
cs_cz: do turnaje je

source: open
cs_cz: otevřená

source: closed
cs_cz: uzavřená

source: , but the maximum number of players has already been reached
cs_cz: , ale již bylo dosaženo maximálního počtu hráčů

source: Order
cs_cz: Pořadí

source: State
cs_cz: Stav

source: Name
cs_cz: Jméno

source: Match count
cs_cz: Počet zápasů

source: Won games
cs_cz: Vyhrané gemy

source: Lost games
cs_cz: Prohrané gemy

source: Ratio
cs_cz: Poměr

source: Payment
cs_cz: Platba

source: Invalid tournament ID.
cs_cz: Neplatné ID turnaje.

source: Filtering by player is only available for logged in users.
cs_cz: Filtrování podle hráče je dostupné pouze pro přihlášené uživatele.

source: No Filter
cs_cz: Nefiltrovat

source: Filter by player
cs_cz: Filtrovat podle hráče

source: You do not have permission to add a player from the database.
cs_cz: Nemáte povolení k přidání hráče z databáze.

source: The option to add a player is closed.
cs_cz: Možnost přidání hráče je uzavřena.

source: Add a new player to the tournament no.
cs_cz: Přidání nového hráče do turnaje č.

source: Add player
cs_cz: Přidat hráče

source: Tournament or user not found.
cs_cz: Turnaj nebo uživatel nenalezen.

source: You need to log in to add a player!
cs_cz: Pro přidání hráče se musíte přihlásit!

source: was added to the tournament.
cs_cz: byl přidán do turnaje.

source: You do not have permission to remove from a special group.
cs_cz: Nemáte povolení k odebrání ze speciální skupiny.

source: The option to remove from a special group is closed.
cs_cz: Možnost odebrání ze speciální skupiny je uzavřena.

source: The special group is empty, so there is no one to subscribe to.
cs_cz: Speciální skupina je prázdná a tak není koho odebírat.

source: No one has signed up for the tournament yet, so there is no one to remove from the special group.
cs_cz: Do turnaje se zatím nikdo nepřihlásil a tak není koho odebrat ze speciální skupiny.

source: Removal from the special group of the tournament no.
cs_cz: Odebrání ze speciální skupiny turnaje č.

source: Remove from special group
cs_cz: Odebrat ze speciální skupiny

source: You must log in to remove from the special group!
cs_cz: Pro odebrání ze speciální skupiny se musíte přihlásit!

source: was taken from a special group.
cs_cz: byl odebraný ze speciální skupiny.

source: You do not have permission to add to a special group.
cs_cz: Nemáte povolení k přidání do speciální skupiny.

source: The option to add to a special group is closed.
cs_cz: Možnost přidání do speciální skupiny je uzavřena.

source: No one has signed up for the tournament yet, so there is no one to include in a special group.
cs_cz: Do turnaje se zatím nikdo nepřihlásil a tak není koho začlenit do speciální skupiny.

source: Addition to the special group of the tournament no.
cs_cz: Přidání do speciální skupiny turnaje č.

source: Add to special group
cs_cz: Přidat do speciální skupiny

source: You must log in to add a player to a special group!
cs_cz: Pro přidání hráče do speciální skupiny se musíte přihlásit!

source: has been added to a special group.
cs_cz: byl přidán do speciální skupiny.

source: The organizer of tournament no.
cs_cz: Pořadatelem turnaje č.

source: is
cs_cz: je

source: You do not have permission to add organizer rights.
cs_cz: Nemáte povolení k přidání práv pořadatele.

source: The option to add organizer rights is closed.
cs_cz: Možnost přidání práv pořadatele je uzavřena.

source: Adding organizer rights in tournament no.
cs_cz: Přidání práv pořadatele v turnaji č.

source: Add organizer rights
cs_cz: Přidat práva pořadatele

source: To add organizer rights, please log in!
cs_cz: Pro přidání pořadatelských práv se musíte přihlásit!

source: has been added to the admins.
cs_cz: byl přidán mezi administrátory.

source: You must log in to temporarily suspend a player!
cs_cz: Pro dočasné pozastavení hráče se musíte přihlásit!

source: The option to suspend the player game is closed.
cs_cz: Možnost pozastavení hry hráče je uzavřena.

source: Suspension of the game of the selected player in tournament no.
cs_cz: Pozastavení hry vybraného hráče v turnaji č.

source: All players
cs_cz: Všichni hráči

source: Suspend participation
cs_cz: Pozastavit účast

source: All players have temporarily suspended participation.
cs_cz: Všichni hráči mají dočasně pozastavenou účast.

source: has temporarily suspended participation.
cs_cz: má dočasně pozastavenou účast.

source: You must log in to restore the game!
cs_cz: Pro obnovení hry se musíte přihlásit!

source: The option to restore the player game is closed.
cs_cz: Možnost obnovení hry hráče je uzavřena.

source: Resuming the game of the selected player in tournament no.
cs_cz: Obnovení hry vybraného hráče v turnaji č.

source: Resume participation
cs_cz: Obnovit účast

source: All players are active.
cs_cz: Všichni hráči jsou aktivní.

source: All players have renewed participation.
cs_cz: Všichni hráči mají obnovenou účast.

source: has renewed participation.
cs_cz: má obnovenou účast.

source: You do not have permission to remove a player.
cs_cz: Nemáte povolení k odebrání hráče.

source: The option to remove a player is closed.
cs_cz: Možnost odebrání hráče je uzavřena.

source: Removing a player from tournament no.
cs_cz: Odebrání hráče z turnaje č.

source: Remove player
cs_cz: Odebrat hráče

source: No one has registered for the tournament yet, so there is no one to remove.
cs_cz: Do turnaje se zatím nikdo nepřihlásil, takže není koho odebrat.

source: To remove a player, you need to log in first!
cs_cz: Pro odebrání hráče se musíte přihlásit!

source: was removed from the tournament.
cs_cz: byl odebrán z turnaje.

source: Match results
cs_cz: Výsledky zápasů

source: Meantime
cs_cz: Zatím

source: were played
cs_cz: bylo odehráno

source: matches and
cs_cz: zápasů a

source: games
cs_cz: gemů

source: Tournament is closed.
cs_cz: Turnaj je ukončen.

source: The tournament is still being played.
cs_cz: Turnaj se stále hraje.

source: R1
cs_cz: P1

source: R2
cs_cz: P2

source: L1+R1
cs_cz: L1+P1

source: L2+R2
cs_cz: L2+P2

source: Player registration is still in progress and the matches have not yet been drawn.
cs_cz: Stále probíhá registrace hráčů a zápasy zatím nejsou rozlosované.

source: was not found.
cs_cz: nebyl nalezen.

source: is closed.
cs_cz: je uzavřen.

source: You cannot go to the finals while registration is open.
cs_cz: Nelze jít do finále, když je registrace otevřená.

source: Winner in the category of the most ideal couple:
cs_cz: Vítěz v kategorii nejideálnější dvojice:

source: The final match is being played.
cs_cz: Právě se hraje finálový zápas.
